InformationRegisters/СтатусОбменовСЯндексКассой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СтатусОбменовСЯндексКассой</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоУспешногоОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Реквизит необходим для обеспечения ограничения доступа</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаЯндексКассы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЯндексКассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусОбменовСЯндексКассой/Forms/ФормаПросмотраСостоянияОбменов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбработатьПереданныеПараметры();
	ОбработатьРазрешениеРедактирования(ЭтотОбъект, РазрешитьРедактирование)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если РазрешитьРедактирование
		и Не ТекущиеДанные = Неопределено
		и Поле.Имя = "ДатаПоследнегоУспешногоОбмена" Тогда 
		
		СписокВыборЗавершение = Новый ОписаниеОповещения("СписокВыборЗавершение",
			ЭтотОбъект,
			Новый Структура("НастройкаЯндексКассы", ТекущиеДанные.НастройкаЯндексКассы));
		
		ПоказатьВводДаты(СписокВыборЗавершение,
			ТекущиеДанные.ДатаПоследнегоУспешногоОбмена,
			НСтр("ru = 'Укажите дату последней загрузки'"),
			ЧастиДаты.ДатаВремя);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(Дата, ДополнительныеПараметры) Экспорт 
	
	Если ЗначениеЗаполнено(Дата) Тогда 
		
		СписокВыборЗавершениеНаСервере(Дата, ДополнительныеПараметры.НастройкаЯндексКассы);
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокВыборЗавершениеНаСервере(Дата, НастройкаЯндексКассы)
	
	РегистрыСведений.СтатусОбменовСЯндексКассой.ОбновитьСтатус(НастройкаЯндексКассы, Дата);
	
КонецПроцедуры

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	ВысотаВСтрокахТаблицы = 0;
	Если Параметры.Свойство("ВысотаВСтрокахТаблицы", ВысотаВСтрокахТаблицы) Тогда 
		Элементы.Список.ВысотаВСтрокахТаблицы = ВысотаВСтрокахТаблицы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьРазрешениеРедактирования(Форма, РазрешитьРедактирование)
	
	Форма.Элементы.ДатаПоследнегоУспешногоОбмена.ТолькоПросмотр = Не РазрешитьРедактирование;
	Форма.Элементы.ФормаРазрешитьРедактирование.Картинка = ?(РазрешитьРедактирование, БиблиотекаКартинок.ФлагУстановлен, БиблиотекаКартинок.ФлагНеУстановлен);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	РазрешитьРедактирование = Не РазрешитьРедактирование;
	ОбработатьРазрешениеРедактирования(ЭтотОбъект, РазрешитьРедактирование);
	
КонецПроцедуры

#КонецОбласти
